//* Розгалуження: if, if...else, else...if
//TODO: 1 ===================================
//Даний рядок, що складається із символів, наприклад, 'abcde'.
// Перевірте, що першим символом цього рядка є буква 'a'.
// Якщо це так - виведіть 'так', інакше виведіть 'ні'.

const str = 'abcde'; 
//    if (str.startsWith("a") ) {
//     console.log("yes");

// } else {
//     console.log("no");
    
// } 

// str.startsWith("a")? console.log("yes") : console.log("no");

// Написати скрипт, який перевіряє чи введене число через prompt потрапляє в діапазон від 55 до 99 включно.
// Якщо так, вивести в консоль "Число потрапляє в діапазон".
// Якщо ні, вивести в консоль "Число не потрапляє в діапазон".

// const number = prompt("enter number");

// if (number >= 55 && number <= 99) {
//     alert("Число потрапляє в діапазон");
// } else {
//     alert("Число не потрапляє в діапазон");
// }

// number >= 55 && number <= 99 ?  alert("Число потрапляє в діапазон") : alert("Число не потрапляє в діапазон");

// Є 3 вікові групи : діти (0-16), дорослі(17-60), пенсіонери (61-100).
// До якої групи відноситься Максим, якщо йому 55 років.Назву групи вивести на екран.

/* const ageMaks = 102;
if (ageMaks >= 0 && ageMaks <= 16) {
    console.log("діти");
    
}
else if (ageMaks >= 17 && ageMaks <= 60) {
    console.log("дорослі");
    
}
else if (ageMaks <=61 && ageMaks <= 100) {
    console.log("пенсіонери");
    
}
else {
console.log("error");

} */